In [2]:
# importing packages
import pandas as pd # Data Manipulations
import numpy as np # Data calculations
import datetime # Datetime transformations

In [3]:
# csv files - semistructured data
# Reading csv files
cust = pd.read_csv("C://Users//purba//OneDrive//Desktop//Class files//Machine Learning using Python (Online) JAN 2026 _ Class 3 Machine Learning using Python (Online) JAN 2026//Customer - 1768721917817.csv")
prod = pd.read_csv("C://Users//purba//OneDrive//Desktop//Class files//Machine Learning using Python (Online) JAN 2026 _ Class 3 Machine Learning using Python (Online) JAN 2026//Product - 1768721917964.csv")
trans = pd.read_csv("C://Users//purba//OneDrive//Desktop//Class files//Machine Learning using Python (Online) JAN 2026 _ Class 3 Machine Learning using Python (Online) JAN 2026//Transactions - 1768721918528.csv")

In [4]:
# Meta Data Inspection

# Dimensions of the dataframes

print(f"The dimensions of the customer dataframe {cust.shape}")
print(f"The dimensions of the transactions dataframe {trans.shape}")
print(f"The dimensions of the products dataframe {prod.shape}")

The dimensions of the customer dataframe (22604, 8)
The dimensions of the transactions dataframe (742018, 10)
The dimensions of the products dataframe (42681, 7)

In [5]:
cust.head()

,Customer ID,Gender,first Date,recent date,Customer value,buy times,Points earned,Points redeemed
0,85498466,M,20120101,20120101,15.9000,1,135,NaN
1,14634939,M,20120102,20130227,4454.0996,35,2130,11.0
2,14860694,F,20120103,20130219,2756.2800,19,987,785.0
3,85570763,M,20120103,20120406,902.3000,6,240,NaN
4,85796047,M,20120106,20120106,39.8000,1,40,NaN

In [6]:
prod.head()

,PRODUCT_ID,PRODUCT_CODE,merchant id,merchant_name_eng,Category_level2_name_eng,cost price,Category_code
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17
1,860,8606,1,Delhi,Beauty,7.500,12
2,861,8617,1,Delhi,Beauty,8.250,12
3,864,8640,1,Delhi,Beauty,11.925,12
4,865,8651,1,Delhi,Beauty,9.750,12

In [7]:
trans.head()

,USER_ID,order id,merchant id,product id,order time,sale amount,sale price,sale number,web portal price,ACTIVITY ID
0,12592130,29501392,1,1143312,20120102,0.00,0.00,1,0.0,14647
1,36438353,29482570,1,1739650,20120102,0.00,0.00,1,69.0,14264
2,73897605,29453567,1,1288235,20120102,0.31,0.51,1,5.1,13679
3,85462069,29506684,1,964626,20120102,0.89,1.00,1,1.7,10885
4,70491566,29412642,1,14264,20120101,1.20,1.20,1,9.9,10818

In [8]:
# Data Types for each dataframe
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22604 entries, 0 to 22603
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer ID      22604 non-null  int64
 1   Gender           22604 non-null  object
 2   first Date       22604 non-null  int64
 3   recent date      22604 non-null  int64
 4   Customer value   22604 non-null  float64
 5   buy times        22604 non-null  int64
 6   Points earned    22604 non-null  int64
 7   Points redeemed  2996 non-null   float64
dtypes: float64(2), int64(5), object(1)
memory usage: 1.4+ MB

In [9]:
prod.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42681 entries, 0 to 42680
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   PRODUCT_ID                42681 non-null  int64
 1   PRODUCT_CODE              42681 non-null  int64
 2   merchant id               42681 non-null  int64
 3   merchant_name_eng         42681 non-null  object
 4   Category_level2_name_eng  42681 non-null  object
 5   cost price                42505 non-null  float64
 6   Category_code             42681 non-null  int64
dtypes: float64(1), int64(4), object(2)
memory usage: 2.3+ MB

In [10]:
trans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 742018 entries, 0 to 742017
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   USER_ID           742018 non-null  int64
 1   order id          742018 non-null  int64
 2   merchant id       742018 non-null  int64
 3   product id        742018 non-null  int64
 4   order time        742018 non-null  int64
 5   sale amount       742018 non-null  float64
 6   sale price        742018 non-null  float64
 7   sale number       742018 non-null  int64
 8   web portal price  742018 non-null  float64
 9   ACTIVITY ID       742018 non-null  int64
dtypes: float64(3), int64(7)
memory usage: 56.6 MB

In [11]:
cust.head(1)

,Customer ID,Gender,first Date,recent date,Customer value,buy times,Points earned,Points redeemed
0,85498466,M,20120101,20120101,15.9,1,135,NaN

In [12]:
# missing values
cust.isnull().sum

<bound method DataFrame.sum of        Customer ID  Gender  first Date  recent date  Customer value  \
0            False   False       False        False           False
1            False   False       False        False           False
2            False   False       False        False           False
3            False   False       False        False           False
4            False   False       False        False           False
...            ...     ...         ...          ...             ...
22599        False   False       False        False           False
22600        False   False       False        False           False
22601        False   False       False        False           False
22602        False   False       False        False           False
22603        False   False       False        False           False

       buy times  Points earned  Points redeemed
0          False          False             True
1          False          False            False
2          False          False            False
3          False          False             True
4          False          False             True
...          ...            ...              ...
22599      False          False             True
22600      False          False             True
22601      False          False             True
22602      False          False             True
22603      False          False             True

[22604 rows x 8 columns]>

In [13]:
# missing values
trans.isnull().sum

<bound method DataFrame.sum of         USER_ID  order id  merchant id  product id  order time  sale amount  \
0         False     False        False       False       False        False
1         False     False        False       False       False        False
2         False     False        False       False       False        False
3         False     False        False       False       False        False
4         False     False        False       False       False        False
...         ...       ...          ...         ...         ...          ...
742013    False     False        False       False       False        False
742014    False     False        False       False       False        False
742015    False     False        False       False       False        False
742016    False     False        False       False       False        False
742017    False     False        False       False       False        False

        sale price  sale number  web portal price  ACTIVITY ID
0            False        False             False        False
1            False        False             False        False
2            False        False             False        False
3            False        False             False        False
4            False        False             False        False
...            ...          ...               ...          ...
742013       False        False             False        False
742014       False        False             False        False
742015       False        False             False        False
742016       False        False             False        False
742017       False        False             False        False

[742018 rows x 10 columns]>

In [14]:
# missing values
prod.isnull().sum

<bound method DataFrame.sum of        PRODUCT_ID  PRODUCT_CODE  merchant id  merchant_name_eng  \
0           False         False        False              False
1           False         False        False              False
2           False         False        False              False
3           False         False        False              False
4           False         False        False              False
...           ...           ...          ...                ...
42676       False         False        False              False
42677       False         False        False              False
42678       False         False        False              False
42679       False         False        False              False
42680       False         False        False              False

       Category_level2_name_eng  cost price  Category_code
0                         False       False          False
1                         False       False          False
2                         False       False          False
3                         False       False          False
4                         False       False          False
...                         ...         ...            ...
42676                     False        True          False
42677                     False        True          False
42678                     False        True          False
42679                     False        True          False
42680                     False        True          False

[42681 rows x 7 columns]>

In [15]:
# list duplicates
cust.duplicated().sum()

np.int64(0)

In [16]:
# list duplicates
trans.duplicated().sum()

np.int64(858)

In [17]:
# list duplicates
prod.duplicated().sum()

np.int64(0)

In [18]:
prod.loc[prod['cost price'].isnull()]

,PRODUCT_ID,PRODUCT_CODE,merchant id,merchant_name_eng,Category_level2_name_eng,cost price,Category_code
42505,1016687,10166877,1,Delhi,Household electrical appliances,NaN,9
42506,2293884,22938847,2,Bangalore,Mother and children,NaN,7
42507,1119493,11194937,1,Delhi,Home,NaN,2
42508,1575388,15753885,1,Delhi,Home,NaN,2
42509,1403241,14032418,1,Delhi,Nutrition and health,NaN,13
...,...,...,...,...,...,...,...
42676,1285136,12851364,1,Delhi,Nutrition and health,NaN,13
42677,1337041,13370417,1,Delhi,Nutrition and health,NaN,13
42678,1676838,16768380,1,Delhi,Mother and children,NaN,7
42679,1312157,13121578,1,Delhi,Household electrical appliances,NaN,9
42680,1285253,12852538,1,Delhi,Nutrition and health,NaN,13

In [19]:
# Missing values
# We need to drop off these records post checking product ids in trans
# no presence in trans table and then drop off

In [20]:
# Data Cleaning

# Variable name has spaces , replace spaces with underscore -
# Date type conversion for trans and cust -
# Deduplication -
# Missing value imputations -

In [21]:
# Variable name has spaces , replace spaces with underscore

In [22]:
cust.columns

Index(['Customer ID', 'Gender', 'first Date', 'recent date', 'Customer value',
       'buy times', 'Points earned', 'Points redeemed'],
      dtype='object')

In [26]:
prod.columns

Index(['PRODUCT_ID', 'PRODUCT_CODE', 'merchant id', 'merchant_name_eng',
       'Category_level2_name_eng', 'cost price', 'Category_code'],
      dtype='object')

In [27]:
trans.columns

Index(['USER_ID', 'order id', 'merchant id', 'product id', 'order time',
       'sale amount', 'sale price', 'sale number', 'web portal price',
       'ACTIVITY ID'],
      dtype='object')

In [23]:
# replace
for col in cust.columns:
    print(col.replace(" ","_"))

Customer_ID
Gender
first_Date
recent_date
Customer_value
buy_times
Points_earned
Points_redeemed

In [24]:
# List comprehension

[col.replace(" ","_") for col in cust.columns]

['Customer_ID',
 'Gender',
 'first_Date',
 'recent_date',
 'Customer_value',
 'buy_times',
 'Points_earned',
 'Points_redeemed']

In [25]:
cust_cols = [col.replace(" ","_") for col in cust.columns]
prod_cols = [col.replace(" ","_") for col in prod.columns]
trans_cols = [col.replace(" ","_") for col in trans.columns]

In [28]:
prod_cols

['PRODUCT_ID',
 'PRODUCT_CODE',
 'merchant_id',
 'merchant_name_eng',
 'Category_level2_name_eng',
 'cost_price',
 'Category_code']

In [29]:
trans_cols

['USER_ID',
 'order_id',
 'merchant_id',
 'product_id',
 'order_time',
 'sale_amount',
 'sale_price',
 'sale_number',
 'web_portal_price',
 'ACTIVITY_ID']

In [30]:
cust.columns = cust_cols

In [31]:
cust.head()

,Customer_ID,Gender,first_Date,recent_date,Customer_value,buy_times,Points_earned,Points_redeemed
0,85498466,M,20120101,20120101,15.9000,1,135,NaN
1,14634939,M,20120102,20130227,4454.0996,35,2130,11.0
2,14860694,F,20120103,20130219,2756.2800,19,987,785.0
3,85570763,M,20120103,20120406,902.3000,6,240,NaN
4,85796047,M,20120106,20120106,39.8000,1,40,NaN

In [32]:
prod.columns=prod_cols

In [33]:
prod.head()

,PRODUCT_ID,PRODUCT_CODE,merchant_id,merchant_name_eng,Category_level2_name_eng,cost_price,Category_code
0,973607,9736076,1,Delhi,Nutrition and health (No.1 Medicine Store),31.122,17
1,860,8606,1,Delhi,Beauty,7.500,12
2,861,8617,1,Delhi,Beauty,8.250,12
3,864,8640,1,Delhi,Beauty,11.925,12
4,865,8651,1,Delhi,Beauty,9.750,12

In [34]:
trans.columns=trans_cols

In [35]:
trans.head()

,USER_ID,order_id,merchant_id,product_id,order_time,sale_amount,sale_price,sale_number,web_portal_price,ACTIVITY_ID
0,12592130,29501392,1,1143312,20120102,0.00,0.00,1,0.0,14647
1,36438353,29482570,1,1739650,20120102,0.00,0.00,1,69.0,14264
2,73897605,29453567,1,1288235,20120102,0.31,0.51,1,5.1,13679
3,85462069,29506684,1,964626,20120102,0.89,1.00,1,1.7,10885
4,70491566,29412642,1,14264,20120101,1.20,1.20,1,9.9,10818

In [ ]:
trans_master = trans_dedup.merge(prod[['PRODUCT_ID', 'PRODUCT_CODE', 'merchant_id', 'merchant_name_eng'
                  , 'cost_price','new_category']], left_on = ['merchant_id', 'product_id'],
            right_on = ['merchant_id','PRODUCT_ID'], how = 'left')